'''
ফাংশন হলো কোডকে ছোট, পুনঃব্যবহারযোগ্য, সহজবোধ্য এবং পরিচালনাযোগ্য করার উপায়।

কেন আমরা ফাংশন ব্যবহার করব?
    . কোড পুনঃব্যবহার (Reusability)
    . একবার লিখলেই বারবার ব্যবহার করা যায়।

কোডকে ছোট ছোট অংশে ভাগ করা যায় (Modularity):
বড় প্রোগ্রাম ছোট ছোট ফাংশনে ভাগ করলে বোঝা ও মেইনটেইন করা সহজ হয়।

কোড পরিষ্কার ও পড়তে সহজ হয় (Readability):
বারবার একই কোড না লিখে শুধু ফাংশনের নাম কল করলেই হয়।

ডিবাগ করা সহজ হয়:
সমস্যা হলে আলাদা ফাংশনেই খুঁজে পাওয়া যায়, পুরো প্রোগ্রাম ঘাঁটতে হয় না।

সহজে টেস্ট করা যায়:
নির্দিষ্ট একটি ফাংশন আলাদা করে চালিয়ে দেখা যায় ঠিকমতো কাজ করছে কি না।
'''

def my_function():
    print('Hello from a function')
my_function()#Hello from a function


def my_function():
    a = 10
    b = 20
    sum = a + b
    print(sum)

my_function()#30


def my_function(a, b):
    sum = a + b
    print(sum)

my_function(20,40)#60